package com.example.testapp.data

import com.example.testapp.R


val lessonCards = listOf(
    LessonCard(
        id = 1,
        title = "Урок 1: Основы личного бюджета",
        description = "Управление личным бюджетом начинается с понимания своих источников дохода, которые могут включать зарплату, бонусы, дивиденды и дополнительный заработок. Основной задачей является распределение этих доходов таким образом, чтобы покрыть все обязательные и необязательные расходы. Обязательные расходы включают в себя аренду или ипотеку, коммунальные услуги, транспорт и продовольственные закупки – все, что необходимо для поддержания жизненно важной деятельности. Необязательные расходы включают развлечения, отпуск, хобби и другие удовольствия. Отдельное внимание стоит уделить накапливанию сбережений – идеальной практикой считается откладывать не менее 20% своих доходов. Ведение бюджета может осуществляться с помощью различных технологий, таких как мобильные приложения или электронные таблицы, что упрощает отслеживание расходов и выявление моделей потребления.",
        imageRes = R.drawable.card1,
    ),
    LessonCard(
        id = 2,
        title = "Урок 2: Финансовые цели",
        description = "Финансовые цели подразделяются на краткосрочные, среднесрочные и долгосрочные, что позволяет структурировать путь к их достижению. Краткосрочные цели могут включать в себя накопление средств для отпуска или покупку нового гаджета. Среднесрочные цели могут быть связаны с покупкой автомобиля или началом собственного бизнеса. Долгосрочные цели часто включают накопление на пенсию или приобретение недвижимости. Использование SMART методологии помогает четко представлять путь к цели и необходимое для этого время. Важно ревизировать и корректировать цели по мере изменения жизненных обстоятельств, чтобы оставаться мотивированным и нацеленным на результаты.",
        imageRes = R.drawable.card2,
    ),
    LessonCard(
        id = 3,
        title = "Урок 3: Доходы и расходы",
        description = "Эффективное управление деньгами требует глубокого понимания циклов доходов и расходов. Регулярный учёт всех поступлений и израсходованных средств позволяет увидеть полную картину финансового состояния. Этот процесс помогает определить избыточные траты и найти возможности для оптимизации расходов. Так, например, ежемесячное сокращение необязательных затрат, таких как дорогие подписки, может высвободить средства для сбережений или инвестиций. Важно помнить о сезонных расходах, таких как подарки на праздники или отпуск, и планировать бюджет с учетом этих факторов. Ведение дневника расходов может стать ценным инструментом для анализа и корректировки финансовых привычек.",
        imageRes = R.drawable.card3,
    ),
    LessonCard(
        id = 4,
        title = "Урок 4: Экстренный фонд",
        description = "Экстренный фонд представляет собой финансовую безопасность, защищающую от неожиданных жизненных ситуаций, таких как серьезные болезни, потери работы или неожиданные ремонтные работы. Эта финансовая подушка создается из средств, которые можно легко и быстро использовать без наложения штрафов. Лучшие места для хранения этого фонда – высоколиквидные счета с низкими рисками, такие как сберегательные счета банков или депозитные сертификаты. Регулярные небольшие взносы на эти счета со временем превращаются в существенную сумму, которая может поддержать семью в течение нескольких месяцев. Наличие экстренного фонда позволяет избежать накопления долгов в кризисной ситуации и снижает уровень финансового стресса.",
        imageRes = R.drawable.card4,
    ),
    LessonCard(
        id = 5,
        title = "Урок 5: Управление долгами",
        description = "Долги могут быть как полезным инструментом для достижения финансовых целей, так и источником значительной нагрузки на бюджет. Эффективное управление долгами включает в себя точную оценку всех существующих обязательств и составление стратегии погашения. Методы \"снежного кома\" и \"лавины\" предлагают разные подходы: в первом случае – внимание в первую очередь на мелкие долги, во втором – на долги с наибольшими процентами. Для снижения долговой нагрузки можно воспользоваться рефинансированием на более выгодных условиях или консолидацией долгов. Ведение чёткого учёта всех платежей и соблюдение графика выплат позволяют улучшить кредитную историю и снизить финансовый стресс.",
        imageRes = R.drawable.card5,
    ),
    LessonCard(
        id = 6,
        title = "Урок 6: Инвестиции для начинающих",
        description = "Инвестирование – ключевой аспект долгосрочного финансового планирования, позволяющий увеличивать капитал. Начинающим инвесторам стоит ознакомиться с базовыми инструментами, такими как акции, облигации, индексные и паевые фонды. Исторически сложилось так, что эти инструменты приносят различную доходность в зависимости от уровня риска и рыночных условий. Принцип диверсификации, подразумевающий распределение средств между различными классами активов, позволяет уменьшить риски. Прежде чем начать инвестировать, важно установить ваши финансовые цели, определить временной горизонт и оценить риск, который вы готовы принять.",
        imageRes = R.drawable.card6,
    ),
)